In [1]:
import pandas as pd

/tmp/ipykernel_9380/4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [6]:
customer_df = pd.read_csv('customer.csv', sep=';')
customer_df.head()

,customer_id,first_name,last_name,gender,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,1953-10-12,Executive Secretary,Health,Mass Customer,N,Yes,060 Morning Avenue,2016,New South Wales,Australia,10
1,2,Eli,Bockman,Male,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,Yes,6 Meadow Vale Court,2153,New South Wales,Australia,10
2,3,Arlin,Dearle,Male,1954-01-20,Recruiting Manager,Property,Mass Customer,N,Yes,0 Holy Cross Court,4211,QLD,Australia,9
3,4,Talbot,NaN,Male,1961-10-03,NaN,IT,Mass Customer,N,No,17979 Del Mar Point,2448,New South Wales,Australia,4
4,5,Sheila-kathryn,Calton,Female,1977-05-13,Senior Editor,NaN,Affluent Customer,N,Yes,9 Oakridge Court,3216,VIC,Australia,9

Выведем информацию по таблице:

In [7]:
customer_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 15 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   customer_id            4000 non-null   int64
 1   first_name             4000 non-null   object
 2   last_name              3875 non-null   object
 3   gender                 4000 non-null   object
 4   DOB                    3913 non-null   object
 5   job_title              3494 non-null   object
 6   job_industry_category  3344 non-null   object
 7   wealth_segment         4000 non-null   object
 8   deceased_indicator     4000 non-null   object
 9   owns_car               4000 non-null   object
 10  address                4000 non-null   object
 11  postcode               4000 non-null   int64
 12  state                  4000 non-null   object
 13  country                4000 non-null   object
 14  property_valuation     4000 non-null   int64
dtypes: int64(3), object(12)
memory usage: 468.9+ KB

Можно заметить, что в столбцах last_name, dob, job_title, job_industry_category имеются пропуски.

In [13]:
transaction_df = pd.read_csv('transaction.csv', sep=';')
transaction_df.head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,list_price,standard_cost
0,1,2,2950,25.02.2017,False,Approved,Solex,Standard,medium,medium,"71,49","53,62"
1,2,3,3120,21.05.2017,True,Approved,Trek Bicycles,Standard,medium,large,"2091,47","388,92"
2,3,37,402,16.10.2017,False,Approved,OHM Cycles,Standard,low,medium,"1793,43","248,82"
3,4,88,3135,31.08.2017,False,Approved,Norco Bicycles,Standard,medium,medium,"1198,46","381,10"
4,5,78,787,01.10.2017,True,Approved,Giant Bicycles,Standard,medium,large,"1765,3","709,48"

Выведем информацию по таблице:

In [14]:
transaction_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   transaction_id    20000 non-null  int64
 1   product_id        20000 non-null  int64
 2   customer_id       20000 non-null  int64
 3   transaction_date  20000 non-null  object
 4   online_order      19640 non-null  object
 5   order_status      20000 non-null  object
 6   brand             19803 non-null  object
 7   product_line      19803 non-null  object
 8   product_class     19803 non-null  object
 9   product_size      19803 non-null  object
 10  list_price        20000 non-null  object
 11  standard_cost     19803 non-null  object
dtypes: int64(3), object(9)
memory usage: 1.8+ MB

Пропуски имеются в столбцах online_order, brand, product_line, product_class, product_size, standard_cost

---

#### Создадим базу данных и таблицы в Postgres при помощи DBeaver

In [ ]:
create database superstore_20240101;

create table customer_20240101
(	
	customer_id int4 primary key
	,first_name varchar(50)
	,last_name varchar(50)
	,gender varchar(30)
	,dob varchar(50)
	,job_title varchar(50)
	,job_industry_category varchar(50)
	,wealth_segment varchar(50)
	,deceased_indicator varchar(50)
	,owns_car varchar(30)
	,address varchar(50)
	,postcode varchar(30)
	,state varchar(30)
	,country varchar(30)
	,property_valuation int4
);

create table transaction_20240101

(
	transaction_id int4 primary key
	,product_id int4
	,customer_id int4
	,transaction_date varchar(30)
	,online_order varchar(30)
	,order_status varchar(30)
	,brand varchar(30)
	,product_line varchar(30)
	,product_class varchar(30)
	,product_size varchar(30)
	,list_price float4
	,standard_cost float4
	,foreign key(customer_id) references customer_20240101 (customer_id) 
);

---

#### Импортируем данные из csv в таблицы

Данные для таблицы customers_20240101 успешно импортировалась:

<img src='../static/img/hw2_2.png'>

Однако при импорте данных в таблицу transaction_20240101 вышла ошибка о том, что в связанной таблице customers отсутствует ключ customer_id 5034

<img src='../static/img/hw2_1.png'>

Было принято решение исключить эти строки из исходной таблицы:

In [18]:
transaction_df = transaction_df.query('customer_id != 5034')

In [20]:
transaction_df.to_csv('transaction_new.csv', index=False)

Теперь импорт данных в таблицу transaction_20240101 прошел успешно:

<img src='../static/img/hw2_3.png'>

---

### Задания

(1 балл) Вывести все уникальные бренды, у которых стандартная стоимость выше 1500 долларов.

In [ ]:
select  distinct  brand
from transaction_20240101 t 
where standard_cost  > 1500;

<img src='../static/img/hw2_4.png'>

Ответ: 6 брендов.

(1 балл) Вывести все подтвержденные транзакции за период '2017-04-01' по '2017-04-09' включительно.

In [ ]:
select  *
from transaction_20240101 t 
where transaction_date::date between '2017-04-01' and '2017-04-09' and order_status = 'Approved';

Ответ: 531 транзакций

(1 балл) Вывести все профессии у клиентов из сферы IT или Financial Services, которые начинаются с фразы 'Senior'.

In [ ]:
select  distinct  job_title 
from customer_20240101 c 
where job_industry_category in ('IT', 'Financial Services') and job_title  like 'Senior%';

<img src='../static/img/hw2_5.png'>

Ответ: 6 профессий.

(1 балл) Вывести все бренды, которые закупают клиенты, работающие в сфере Financial Services

In [ ]:
select distinct  brand
from customer_20240101 c 
join transaction_20240101 t 
on c.customer_id = t.customer_id 
where c.job_industry_category = 'Financial Services';

<img src='../static/img/hw2_6.png'>

ответ: 7, включая категорию *Без бренда*. и 6 если считать только названные бренды.

(1 балл) Вывести 10 клиентов, которые оформили онлайн-заказ продукции из брендов 'Giant Bicycles', 'Norco Bicycles', 'Trek Bicycles'.

При помощи subquery:

In [ ]:
select *
from customer_20240101 c 
where customer_id in
(select distinct customer_id from transaction_20240101 t 
where brand in ('Giant Bicycles', 'Norco Bicycles', 'Trek Bicycles') and online_order = 'True') limit 10;

<img src='../static/img/hw2_7.png'>

(1 балл) Вывести всех клиентов, у которых нет транзакций.

При помощи subquery:

In [ ]:
select * 
from customer_20240101 c 
where customer_id  not in
(select distinct customer_id from transaction_20240101 t);

<img src='../static/img/hw2_8.png'>

(2 балла) Вывести всех клиентов из IT, у которых транзакции с максимальной стандартной стоимостью.

При помощи join:

In [ ]:
select *
from customer_20240101 c 
inner join transaction_20240101 t 
on c.customer_id = t.customer_id 
where job_industry_category = 'IT' and t.standard_cost = (select  max(standard_cost) 
from transaction_20240101 t);

При помощи subquery:

In [ ]:
select *
from customer_20240101 c 
where job_industry_category = 'IT' and 
customer_id  in 
(select distinct customer_id from transaction_20240101 t where standard_cost = (select  max(standard_cost) 
from transaction_20240101 t));

<img src='../static/img/hw2_9.png'>

(2 балла) Вывести всех клиентов из сферы IT и Health, у которых есть подтвержденные транзакции за период '2017-07-07' по '2017-07-17'.

При помощи subquery:

In [ ]:
select *
from customer_20240101 c 
where job_industry_category in ('IT', 'Health') and customer_id in
(select distinct customer_id from transaction_20240101 t where transaction_date::date between '2017-07-07' and '2017-07-17' and order_status = 'Approved');

<img src='../static/img/hw2_10.png'>